app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 2], ["id", 2], ["LIMIT", 1]]
UPDATE "todos" SET "title" = ?, "description" = ?, "priority" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Add todo endpoint"], ["description", "Make sure you create a todo on thunder client"], ["priority", 1], ["updated_at", "2023-03-23 09:59:27.960868"], ["id", 2]]
---
def update
    todo = user.todos.find(params[:id]).update(todo_params)